{
  "activation_dropout": 0.0,
  "activation_function": "gelu",
  "architectures": [
    "BlenderbotForCausalLM"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 1,
  "d_model": 16,
  "decoder_attention_heads": 4,
  "decoder_ffn_dim": 4,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 2,
  "decoder_start_token_id": 1,
  "dropout": 0.1,
  "encoder_attention_heads": 4,
  "encoder_ffn_dim": 4,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 2,
  "encoder_no_repeat_ngram_size": 3,
  "eos_token_id": 2,
  "forced_eos_token_id": null,
  "init_std": 0.02,
  "is_decoder": true,
  "is_encoder_decoder": false,
  "max_position_embeddings": 100,
  "model_type": "blenderbot",
  "num_hidden_layers": 2,
  "pad_token_id": 0,
  "scale_embedding": false,
  "torch_dtype": "float32",
  "transformers_version": "4.55.2",
  "use_cache": true,
  "vocab_size": 1024
}
