{
  "architectures": [
    "BambaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attn_layer_indices": [
    9,
    18,
    27
  ],
  "attn_rotary_emb": 64,
  "bos_token_id": 128000,
  "eos_token_id": 128001,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "mamba_chunk_size": 256,
  "mamba_conv_bias": true,
  "mamba_d_conv": 4,
  "mamba_d_head": 64,
  "mamba_d_state": 128,
  "mamba_dt_rank": 256,
  "mamba_expand": 2,
  "mamba_n_groups": 1,
  "mamba_n_heads": 128,
  "mamba_proj_bias": false,
  "max_position_embeddings": 4096,
  "mlp_bias": false,
  "model_type": "bamba",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "num_logits_to_keep": 1,
  "pad_token_id": 0,
  "partial_rotary_factor": 0.5,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "transformers_version": "4.55.2",
  "use_cache": true,
  "use_mamba_kernels": true,
  "vocab_size": 128256,
  "z_loss_coefficient": 0.0
}
