{
  "activation_function": "silu",
  "architectures": [
    "JetMoEForCausalLM"
  ],
  "attention_dropout": 0.0,
  "aux_loss_coef": 0.01,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "ffn_hidden_size": 5632,
  "glu": true,
  "hidden_size": 2048,
  "initializer_range": 0.01,
  "intermediate_size": 5632,
  "kv_channels": 128,
  "layer_norm_epsilon": 1e-05,
  "max_position_embeddings": 4096,
  "model_type": "jetmoe",
  "moe_num_experts": 8,
  "moe_top_k": 2,
  "n_positions": 4096,
  "num_attention_heads": 32,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 24,
  "num_key_value_heads": 16,
  "num_layers": 24,
  "num_local_experts": 8,
  "output_router_logits": false,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000.0,
  "rotary_percent": 1.0,
  "transformers_version": "4.55.2",
  "use_cache": true,
  "vocab_size": 32000
}
