{
  "activation_function": "gelu_new",
  "architectures": [
    "CodeGenForCausalLM"
  ],
  "attn_pdrop": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_codegen.CodeGenConfig",
    "AutoModel": "modeling_codegen.CodeGenModel",
    "AutoModelForCausalLM": "modeling_codegen.CodeGenForCausalLM"
  },
  "bos_token_id": 1,
  "embd_pdrop": 0.0,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "head_dim": 32,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "model_type": "codegen",
  "n_ctx": 512,
  "n_embd": 32,
  "n_head": 8,
  "n_inner": null,
  "n_layer": 2,
  "n_positions": 512,
  "resid_pdrop": 0.0,
  "rotary_dim": 4,
  "scale_attn_weights": true,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 50,
      "temperature": 1.0
    }
  },
  "tie_word_embeddings": false,
  "tokenizer_class": "GPT2Tokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.55.2",
  "trust_remote_code": true,
  "use_cache": true,
  "vocab_size": 51200
}
