{
  "architectures": [
    "DbrxForCausalLM"
  ],
  "attn_config": {
    "attn_pdrop": 0.0,
    "clip_qkv": 8,
    "kv_n_heads": 2,
    "model_type": "",
    "rope_theta": 500000
  },
  "d_model": 8,
  "emb_pdrop": 0.0,
  "ffn_config": {
    "ffn_act_fn": {
      "name": "silu"
    },
    "ffn_hidden_size": 8,
    "model_type": "",
    "moe_jitter_eps": 0,
    "moe_loss_weight": 0.05,
    "moe_normalize_expert_weights": 1.0,
    "moe_num_experts": 16,
    "moe_top_k": 4
  },
  "initializer_range": 0.02,
  "max_seq_len": 32768,
  "model_type": "dbrx",
  "n_heads": 4,
  "n_layers": 2,
  "num_key_value_heads": 2,
  "output_router_logits": false,
  "resid_pdrop": 0.0,
  "router_aux_loss_coef": 0.05,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.55.2",
  "use_cache": true,
  "vocab_size": 100352
}
