{
  "architectures": [
    "Ernie4_5_MoeForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_ernie4_5_moe.Ernie4_5_MoeConfig",
    "AutoModel": "modeling_ernie4_5_moe.Ernie4_5_Model",
    "AutoModelForCausalLM": "modeling_ernie4_5_moe.Ernie4_5_MoeForCausalLM"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 2560,
  "initializer_range": 0.02,
  "intermediate_size": 12288,
  "max_position_embeddings": 131072,
  "model_type": "ernie4_5_moe",
  "moe_capacity": [
    64,
    64,
    64
  ],
  "moe_intermediate_size": 1536,
  "moe_k": 6,
  "moe_layer_end_index": 27,
  "moe_layer_interval": 1,
  "moe_layer_start_index": 1,
  "moe_norm_min": 1e-12,
  "moe_num_experts": 64,
  "moe_num_shared_experts": 2,
  "moe_use_aux_free": true,
  "multi_token_pred_lambda": 1.0,
  "num_attention_heads": 20,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "num_nextn_predict_layers": 1,
  "output_router_logits": false,
  "pad_token_id": 0,
  "quantization": {
    "bits": 4,
    "group_size": 64
  },
  "quantization_config": {
    "bits": 4,
    "group_size": 64
  },
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 500000,
  "router_aux_loss_coef": 0.001,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.55.2",
  "use_bias": false,
  "use_cache": false,
  "vocab_size": 103424
}
