{
  "architectures": [
    "ArceeForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "eos_token_id": 128001,
  "head_dim": 16,
  "hidden_act": "relu2",
  "hidden_size": 64,
  "initializer_range": 0.02,
  "intermediate_size": 32,
  "max_position_embeddings": 4096,
  "mlp_bias": false,
  "model_type": "arcee",
  "num_attention_heads": 4,
  "num_hidden_layers": 2,
  "num_key_value_heads": 2,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers.js_config": {
    "dtype": "fp32",
    "use_external_data_format": true
  },
  "transformers_version": "4.55.2",
  "use_cache": true,
  "vocab_size": 32000
}
