{
  "architectures": [
    "DogeForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_doge.DogeConfig",
    "AutoModelForCausalLM": "modeling_doge.DogeForCausalLM"
  },
  "bos_token_id": 0,
  "dynamic_mask_ratio": 0.0,
  "eos_token_id": 1,
  "expert_retrieval_size": 64,
  "hidden_act": "silu",
  "hidden_bias": false,
  "hidden_dropout": 0.0,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "is_moe": false,
  "keep_window_size": 2048,
  "max_position_embeddings": 2048,
  "mlp_bias": false,
  "model_type": "doge",
  "norm_topk_prob": false,
  "num_attention_heads": 6,
  "num_cdmoe_experts": 16348,
  "num_cdmoe_experts_per_head": 8,
  "num_cdmoe_heads": 4,
  "num_experts": 16384,
  "num_experts_per_tok": 64,
  "num_hidden_layers": 24,
  "num_key_value_heads": 3,
  "output_router_logits": false,
  "pad_token_id": 2,
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "factor": 4.0,
    "original_max_position_embeddings": 2048,
    "rope_type": "dynamic"
  },
  "rope_theta": 10000.0,
  "router_aux_loss_coef": 0.001,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.55.2",
  "use_cache": true,
  "vocab_size": 32768
}
