{
  "architectures": [
    "MixtralForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "head_dim": null,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 32768,
  "model_type": "mixtral",
  "num_attention_heads": 32,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "num_local_experts": 8,
  "output_router_logits": false,
  "pad_token_id": 0,
  "pretraining_tp": 1,
  "quantization_config": {
    "bits": 4,
    "damp_percent": 0.1,
    "desc_act": true,
    "group_size": -1,
    "model_file_base_name": "model",
    "model_name_or_path": null,
    "modules_in_block_to_quantize": [
      [
        "self_attn.k_proj",
        "self_attn.v_proj",
        "self_attn.q_proj"
      ],
      [
        "self_attn.o_proj"
      ],
      [
        "block_sparse_moe.experts.0.w1",
        "block_sparse_moe.experts.0.w2",
        "block_sparse_moe.experts.0.w3"
      ],
      [
        "block_sparse_moe.experts.1.w1",
        "block_sparse_moe.experts.1.w2",
        "block_sparse_moe.experts.1.w3"
      ],
      [
        "block_sparse_moe.experts.2.w1",
        "block_sparse_moe.experts.2.w2",
        "block_sparse_moe.experts.2.w3"
      ],
      [
        "block_sparse_moe.experts.3.w1",
        "block_sparse_moe.experts.3.w2",
        "block_sparse_moe.experts.3.w3"
      ],
      [
        "block_sparse_moe.experts.4.w1",
        "block_sparse_moe.experts.4.w2",
        "block_sparse_moe.experts.4.w3"
      ],
      [
        "block_sparse_moe.experts.5.w1",
        "block_sparse_moe.experts.5.w2",
        "block_sparse_moe.experts.5.w3"
      ],
      [
        "block_sparse_moe.experts.6.w1",
        "block_sparse_moe.experts.6.w2",
        "block_sparse_moe.experts.6.w3"
      ],
      [
        "block_sparse_moe.experts.7.w1",
        "block_sparse_moe.experts.7.w2",
        "block_sparse_moe.experts.7.w3"
      ]
    ],
    "quant_method": "gptq",
    "sym": true,
    "true_sequential": true
  },
  "rms_norm_eps": 1e-05,
  "rope_theta": 1000000.0,
  "router_aux_loss_coef": 0.02,
  "router_jitter_noise": 0.0,
  "sliding_window": 4096,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.55.2",
  "use_cache": true,
  "vocab_size": 32000
}
