{
  "architectures": [
    "Llama4ForCausalLM"
  ],
  "attention_bias": false,
  "attention_chunk_size": 8192,
  "attention_dropout": 0.0,
  "attn_scale": 0.1,
  "attn_temperature_tuning": 4,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "floor_scale": 8192,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 8,
  "initializer_range": 0.02,
  "interleave_moe_layer_step": 1,
  "intermediate_size": 32,
  "intermediate_size_mlp": 16384,
  "layer_types": [
    "chunked_attention",
    "chunked_attention"
  ],
  "max_position_embeddings": 131072,
  "model_type": "llama4_text",
  "moe_layers": [
    0,
    1
  ],
  "no_rope_layers": [
    1,
    1
  ],
  "num_attention_heads": 4,
  "num_experts_per_tok": 1,
  "num_hidden_layers": 2,
  "num_key_value_heads": 2,
  "num_local_experts": 16,
  "output_router_logits": false,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 500000,
  "router_aux_loss_coef": 0.001,
  "router_jitter_noise": 0.0,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.55.2",
  "use_cache": true,
  "use_qk_norm": true,
  "vocab_size": 201135
}
