{
  "architectures": [
    "CohereForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 5,
  "eos_token_id": 255001,
  "hidden_act": "silu",
  "hidden_size": 8,
  "initializer_range": 0.02,
  "intermediate_size": 32,
  "layer_norm_eps": 1e-05,
  "logit_scale": 0.0625,
  "max_position_embeddings": 8192,
  "model_type": "cohere",
  "num_attention_heads": 4,
  "num_hidden_layers": 2,
  "num_key_value_heads": 2,
  "pad_token_id": 0,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "torch_dtype": "float32",
  "transformers_version": "4.55.2",
  "use_cache": true,
  "use_qk_norm": false,
  "vocab_size": 255037
}
